Core/src/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПеремещение</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВизита</name>
    <type>
      <types>DocumentRef.Визит</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказаНаПеремещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>БуферВремени</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/AccumulationRegisters/ЗаказыНаПеремещение/ЗаказыНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыНаПеремещение</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/AccumulationRegisters/ЗаказыПокупателей/ЗаказыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПокупателей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.СписаниеТопливаЗапасов</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyКонтрагенты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПартииНоменклатуры</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
  <enumValues>
    <name>Лицензия</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/ВнутреннийЗаказ/ObjectModule.bsl
//Переменные
Перем ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры
	
	
//Процедура ОбработкаЗаполнения(ДокументСсылкаЗаказПокупателя)
//	
//	
//	Если Не ЗначениеЗаполнено(ДокументСсылкаЗаказПокупателя) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Заполнение шапки.
//	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаЗаказПокупателя,
//	Новый Структура("Организация, Ссылка, ВидОперации, Старт, ДатаОтгрузки, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП"));
//	
//	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДокументСсылкаЗаказПокупателя, ЗначенияРеквизитов);
//	
//	Организация = ЗначенияРеквизитов.Организация;
//	ЗаказПокупателя = ЗначенияРеквизитов.Ссылка;
//	//Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
//	//	ДатаПоступления = ЗначенияРеквизитов.Старт;
//	//Иначе
//	//	ДатаПоступления = ЗначенияРеквизитов.ДатаОтгрузки;
//	//КонецЕсли;
//	
//	// Заполнение табличной части.
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
//	|	ЗаказыОстатки.Характеристика КАК Характеристика,
//	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
//	|		ЗаказыОстатки.Характеристика КАК Характеристика,
//	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
//	|	ИЗ
//	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
//	|				,
//	|				ЗаказПокупателя = &ДокументОснование
//	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ЗапасыОстатки.Номенклатура,
//	|		ЗапасыОстатки.Характеристика,
//	|		-ЗапасыОстатки.КоличествоОстаток
//	|	ИЗ
//	|		РегистрНакопления.Запасы.Остатки(
//	|				,
//	|				ЗаказПокупателя = &ДокументОснование
//	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		РазмещениеОстатки.Номенклатура,
//	|		РазмещениеОстатки.Характеристика,
//	|		-РазмещениеОстатки.КоличествоОстаток
//	|	ИЗ
//	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
//	|				,
//	|				ЗаказПокупателя = &ДокументОснование
//	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
//	|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
//	|		ВЫБОР
//	|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//	|		КОНЕЦ
//	|	ИЗ
//	|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
//	|	ГДЕ
//	|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
//	|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЗаказыОстатки.Номенклатура,
//	|	ЗаказыОстатки.Характеристика
//	|
//	|ИМЕЮЩИЕ
//	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МИНИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки,
//	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
//	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//	|			ТОГДА 1
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
//	|	КОНЕЦ КАК Коэффициент,
//	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
//	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
//	|	КОНЕЦ КАК ЗапасыДатаПоступления,
//	|	ЗаказПокупателяЗапасы.СтавкаНДС,
//	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
//	|	ЗаказПокупателяЗапасы.Спецификация
//	|ИЗ
//	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
//	|ГДЕ
//	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЗаказПокупателяЗапасы.Номенклатура,
//	|	ЗаказПокупателяЗапасы.Характеристика,
//	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
//	|	ЗаказПокупателяЗапасы.СтавкаНДС,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//	|			ТОГДА 1
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
//	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
//	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
//	|	КОНЕЦ,
//	|	ЗаказПокупателяЗапасы.Спецификация
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки";
//	
//	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
//	
//	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
//		
//		Запрос.Текст = Запрос.Текст + "; " +
//		"ВЫБРАТЬ
//		|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
//		|	ЗаказыОстатки.Характеристика КАК Характеристика,
//		|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
//		|		ЗапасыОстатки.Характеристика КАК Характеристика,
//		|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
//		|	ИЗ
//		|		РегистрНакопления.Запасы.Остатки(
//		|				,
//		|				ЗаказПокупателя = &ДокументОснование
//		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		РазмещениеОстатки.Номенклатура,
//		|		РазмещениеОстатки.Характеристика,
//		|		РазмещениеОстатки.КоличествоОстаток
//		|	ИЗ
//		|		РегистрНакопления.РазмещениеЗаказов.Остатки(
//		|				,
//		|				ЗаказПокупателя = &ДокументОснование
//		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
//		|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
//		|		ВЫБОР
//		|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|				ТОГДА ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//		|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
//		|		КОНЕЦ
//		|	ИЗ
//		|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
//		|	ГДЕ
//		|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
//		|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ЗаказыОстатки.Номенклатура,
//		|	ЗаказыОстатки.Характеристика
//		|
//		|ИМЕЮЩИЕ
//		|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	МИНИМУМ(ЗаказПокупателяМатериалы.НомерСтроки) КАК НомерСтроки,
//		|	ЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
//		|	ЗаказПокупателяМатериалы.Характеристика КАК Характеристика,
//		|	ЗаказПокупателяМатериалы.Партия КАК Партия,
//		|	ВЫБОР
//		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//		|			ТОГДА 1
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
//		|	КОНЕЦ КАК Коэффициент,
//		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//		|	ВЫБОР
//		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
//		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
//		|	КОНЕЦ КАК СтавкаНДС,
//		|	ЗаказПокупателяМатериалы.Ссылка.Старт КАК ЗапасыДатаПоступления,
//		|	СУММА(ЗаказПокупателяМатериалы.Количество) КАК Количество
//		|ИЗ
//		|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
//		|ГДЕ
//		|	ЗаказПокупателяМатериалы.Ссылка = &ДокументОснование
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ЗаказПокупателяМатериалы.Номенклатура,
//		|	ЗаказПокупателяМатериалы.Характеристика,
//		|	ЗаказПокупателяМатериалы.Партия,
//		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
//		|	ЗаказПокупателяМатериалы.Ссылка,
//		|	ВЫБОР
//		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
//		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
//		|			ТОГДА 1
//		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
//		|	КОНЕЦ,
//		|	ЗаказПокупателяМатериалы.Ссылка.Старт
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки";
//		
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаЗаказПокупателя);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	МассивРезультатов = Запрос.ВыполнитьПакет();
//	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
//	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
//	
//	Запасы.Очистить();
//	Если ТаблицаОстатков.Количество() > 0 Тогда
//		
//		Выборка = МассивРезультатов[1].Выбрать();
//		Пока Выборка.Следующий() Цикл
//			
//			СтруктураДляПоиска = Новый Структура;
//			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
//			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
//			
//			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
//			Если МассивСтрокОстатков.Количество() = 0 Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрока = Запасы.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//			
//			КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
//			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
//			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
//				
//				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
//				
//			КонецЕсли;
//			
//			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
//			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
//			//	ПоложениеДатыПоступленияВШапке = Ложь;
//			//КонецЕсли;
//			
//			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
//				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	

//	
//	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
//		
//		МассивРезультатов = Запрос.ВыполнитьПакет();
//		ТаблицаОстатков = МассивРезультатов[2].Выгрузить();
//		ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
//		
//		Выборка = МассивРезультатов[3].Выбрать();
//		Пока Выборка.Следующий() Цикл
//			
//			СтруктураДляПоиска = Новый Структура;
//			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
//			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
//			
//			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
//			Если МассивСтрокОстатков.Количество() = 0 Тогда
//				
//				НоваяСтрока = Запасы.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//				
//			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) = Выборка.Количество Тогда
//				
//				Продолжить;
//				
//			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) > Выборка.Количество Тогда
//				
//				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - Выборка.Количество * Выборка.Коэффициент;
//				Продолжить;
//				
//			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) < Выборка.Количество Тогда
//				
//				КоличествоКСписанию = -1 * (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент - Выборка.Количество);
//				МассивСтрокОстатков[0].КоличествоОстаток = 0;
//				
//				НоваяСтрока = Запасы.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//				
//				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
//				
//			КонецЕсли;


//			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
//			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
//			//	ПоложениеДатыПоступленияВШапке = Ложь;
//			//КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецПроцедуры
//	
	

	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Булево = Константы.ВнутреннийЗаказЗаморозкаВремени.СоздатьМенеджерЗначения();
    Булево.Прочитать();    
	ЗамораживатьДату = Булево.Значение;
	
	Если Не ЗначениеЗаполнено(БуферВремени) И ЗамораживатьДату Тогда
		БуферВремени = Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БуферВремени) И ЗамораживатьДату Тогда
		Дата = БуферВремени;
	КонецЕсли;
	

	Если НЕ ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыЗаказаНаПеремещения.Утвержден Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаПеремещениеЗапасы.Ссылка.Дата КАК Период,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
			|	ЗаказНаПеремещениеЗапасы.Ссылка КАК Заказ,
			|	ЗаказНаПеремещениеЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	ЗаказНаПеремещениеЗапасы.Номенклатура КАК Номенклатура,
			|	ЗаказНаПеремещениеЗапасы.Характеристика КАК Характеристика,
			|	ЗаказНаПеремещениеЗапасы.Партия КАК Партия,
			|	СУММА(ВЫБОР
			|			КОГДА ЗаказНаПеремещениеЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.КлассификаторЕдиницИзмерения
			|				ТОГДА ЗаказНаПеремещениеЗапасы.УтвержденноеКоличество
			|			ИНАЧЕ ЗаказНаПеремещениеЗапасы.УтвержденноеКоличество * ЗаказНаПеремещениеЗапасы.ЕдиницаИзмерения.Коэффициент
			|		КОНЕЦ) КАК Количество,
			|	ВЫБОР
			|		КОГДА ЗаказНаПеремещениеЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
			|		ИНАЧЕ ЗаказНаПеремещениеЗапасы.Проект
			|	КОНЕЦ КАК Проект
			|ИЗ
			|	Документ.ВнутреннийЗаказ.Запасы КАК ЗаказНаПеремещениеЗапасы
			|ГДЕ
			|	ЗаказНаПеремещениеЗапасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказНаПеремещениеЗапасы.Номенклатура,
			|	ЗаказНаПеремещениеЗапасы.Характеристика,
			|	ЗаказНаПеремещениеЗапасы.Партия,
			|	ЗаказНаПеремещениеЗапасы.Ссылка.Дата,
			|	ЗаказНаПеремещениеЗапасы.Ссылка,
			|	ЗаказНаПеремещениеЗапасы.Ссылка.СтруктурнаяЕдиница,
			|	ВЫБОР
			|		КОГДА ЗаказНаПеремещениеЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
			|		ИНАЧЕ ЗаказНаПеремещениеЗапасы.Проект
			|	КОНЕЦ";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();		
	Иначе
		ТаблицаЗаказов = Новый ТаблицаЗначений;
	КонецЕсли;
	ДвиженияЗаказов = Движения.ЗаказыНаПеремещение;
	ДвиженияЗаказов.Записывать = Истина;
	ДвиженияЗаказов.Загрузить(ТаблицаЗаказов);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах");
	Если ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах Тогда
		Если Статус = Перечисления.СтатусыЗаказаНаПеремещения.Утвержден Тогда
			ПроверяемыеРеквизиты.Добавить("Запасы.УтвержденноеКоличество");
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,ДокументСсылкаЗаказПокупателя)
	
	//giga
	Если ТипЗнч(ДокументСсылкаЗаказПокупателя) = Тип("Булево") Тогда
		 ДокументСсылкаЗаказПокупателя = Ссылка;
	КонецЕсли;
	//giga
	
	Если ТипЗнч(ДокументСсылкаЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// ქუდის შევსება
		Автор = ДокументСсылкаЗаказПокупателя.Автор;
		ДокументВизита = ДокументСсылкаЗаказПокупателя.ДокументВизита;
		ЗапретРедактированияДокументов = ДокументСсылкаЗаказПокупателя.ЗапретРедактированияДокументов;
		Комментарий = ДокументСсылкаЗаказПокупателя.Комментарий;
		Организация = ДокументСсылкаЗаказПокупателя.Организация;
		Ответственный = ДокументСсылкаЗаказПокупателя.Ответственный;
		СтруктурнаяЕдиница = ДокументСсылкаЗаказПокупателя.СтруктурнаяЕдиницаРезерв;
		Для Каждого ТекСтрокаЗапасы Из ДокументСсылкаЗаказПокупателя.Запасы Цикл
			НоваяСтрока = Запасы.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаЗапасы.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаЗапасы.Количество;
			НоваяСтрока.Партия = ТекСтрокаЗапасы.Партия;
			НоваяСтрока.Характеристика = ТекСтрокаЗапасы.Характеристика;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументСсылкаЗаказПокупателя) Тогда
		ЗаполнитьПоЗаказуНаПроизводство(ДокументСсылкаЗаказПокупателя);
	Иначе
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДокументСсылкаЗаказПокупателя);
		Если Ссылка.Пустая() Тогда
			СтруктурнаяЕдиница = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ОсновнойСклад");
		КонецЕсли;
	КонецЕсли;
		
		
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";	
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнаойНакладной";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
	
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДокументСсылкаЗаказПокупателя)
	
	// Заполнение шапки.
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаЗаказПокупателя,
	Новый Структура("Организация, Ссылка, ВидОперации, Старт, ДатаОтгрузки, СостояниеЗаказа, Проведен, ОжидаетсяВыборВариантаКП"));
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДокументСсылкаЗаказПокупателя, ЗначенияРеквизитов);
	
	Организация = ЗначенияРеквизитов.Организация;
	ЗаказПокупателя = ЗначенияРеквизитов.Ссылка;
	//Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
	//	ДатаПоступления = ЗначенияРеквизитов.Старт;
	//Иначе
	//	ДатаПоступления = ЗначенияРеквизитов.ДатаОтгрузки;
	//КонецЕсли;
	
	// Заполнение табличной части.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		-ЗапасыОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РазмещениеОстатки.Номенклатура,
	|		РазмещениеОстатки.Характеристика,
	|		-РазмещениеОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов.Остатки(
	|				,
	|				ЗаказПокупателя = &ДокументОснование
	|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
	|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
	|	ГДЕ
	|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
	|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
	|	КОНЕЦ КАК ЗапасыДатаПоступления,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество,
	|	ЗаказПокупателяЗапасы.Спецификация
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	ЗаказПокупателяЗапасы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.Старт
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
	|	КОНЕЦ,
	|	ЗаказПокупателяЗапасы.Спецификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказПокупателя, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		Запрос.Текст = Запрос.Текст + "; " +
		"ВЫБРАТЬ
		|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыОстатки.Характеристика КАК Характеристика,
		|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|		ЗапасыОстатки.Характеристика КАК Характеристика,
		|		ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.Запасы.Остатки(
		|				,
		|				ЗаказПокупателя = &ДокументОснование
		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК ЗапасыОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РазмещениеОстатки.Номенклатура,
		|		РазмещениеОстатки.Характеристика,
		|		РазмещениеОстатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.РазмещениеЗаказов.Остатки(
		|				,
		|				ЗаказПокупателя = &ДокументОснование
		|					И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)) КАК РазмещениеОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокументаРазмещениеЗаказов.Номенклатура,
		|		ДвиженияДокументаРазмещениеЗаказов.Характеристика,
		|		ВЫБОР
		|			КОГДА ДвиженияДокументаРазмещениеЗаказов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
		|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаРазмещениеЗаказов.Количество, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РазмещениеЗаказов КАК ДвиженияДокументаРазмещениеЗаказов
		|	ГДЕ
		|		ДвиженияДокументаРазмещениеЗаказов.Регистратор = &Ссылка
		|		И ДвиженияДокументаРазмещениеЗаказов.ЗаказПокупателя = &ДокументОснование) КАК ЗаказыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыОстатки.Номенклатура,
		|	ЗаказыОстатки.Характеристика
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ЗаказПокупателяМатериалы.НомерСтроки) КАК НомерСтроки,
		|	ЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяМатериалы.Характеристика КАК Характеристика,
		|	ЗаказПокупателяМатериалы.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА 1
		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Коэффициент,
		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
		|	КОНЕЦ КАК СтавкаНДС,
		|	ЗаказПокупателяМатериалы.Ссылка.Старт КАК ЗапасыДатаПоступления,
		|	СУММА(ЗаказПокупателяМатериалы.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
		|ГДЕ
		|	ЗаказПокупателяМатериалы.Ссылка = &ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяМатериалы.Номенклатура,
		|	ЗаказПокупателяМатериалы.Характеристика,
		|	ЗаказПокупателяМатериалы.Партия,
		|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения,
		|	ЗаказПокупателяМатериалы.Ссылка,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
		|			ТОГДА ЗаказПокупателяМатериалы.Ссылка.Организация.СтавкаНДСПоУмолчанию
		|		ИНАЧЕ ЗаказПокупателяМатериалы.Номенклатура.СтавкаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
		|			ТОГДА 1
		|		ИНАЧЕ ЗаказПокупателяМатериалы.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ,
		|	ЗаказПокупателяМатериалы.Ссылка.Старт
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаЗаказПокупателя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
	
	Запасы.Очистить();
	Если ТаблицаОстатков.Количество() > 0 Тогда
		
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
			Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
				
				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
				
			КонецЕсли;
			
			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
			//	ПоложениеДатыПоступленияВШапке = Ложь;
			//КонецЕсли;
			
			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ТаблицаОстатков = МассивРезультатов[2].Выгрузить();
		ТаблицаОстатков.Индексы.Добавить("Номенклатура,Характеристика");
		
		Выборка = МассивРезультатов[3].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				
				НоваяСтрока = Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) = Выборка.Количество Тогда
				
				Продолжить;
				
			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) > Выборка.Количество Тогда
				
				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - Выборка.Количество * Выборка.Коэффициент;
				Продолжить;
				
			ИначеЕсли (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент) < Выборка.Количество Тогда
				
				КоличествоКСписанию = -1 * (МассивСтрокОстатков[0].КоличествоОстаток / Выборка.Коэффициент - Выборка.Количество);
				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				
				НоваяСтрока = Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.Количество = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
				
			КонецЕсли;


			//НоваяСтрока.ДатаПоступления = Выборка.ЗапасыДатаПоступления;
			//Если ДатаПоступления <> НоваяСтрока.ДатаПоступления Тогда
			//	ПоложениеДатыПоступленияВШапке = Ложь;
			//КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	

КонецПроцедуры

// Процедура заполнения документа на основании заказа поставщику.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения) Экспорт
	
	// Основание и настройка документа.
	МассивЗаказов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МассивЗаказовПоставщикам") Тогда
		МассивЗаказов = ДанныеЗаполнения.МассивЗаказовПоставщикам;
		ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	Иначе
		МассивЗаказов.Добавить(ДанныеЗаполнения.Ссылка);
		ПоложениеЗаказаПоставщику = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ПоложениеЗаказаПоставщикуВДокументахПоступления");
		Если НЕ ЗначениеЗаполнено(ПоложениеЗаказаПоставщику) Тогда
			ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		КонецЕсли;
		Если ПоложениеЗаказаПоставщику = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
			Заказ = ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
	
	// Заполнение шапки.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК ОснованиеСсылка,
	|	ЗаказПоставщику.Проведен КАК ОснованиеПроведен,
	|	ЗаказПоставщику.СостояниеЗаказа КАК СостояниеЗаказа,
	|	ЗаказПоставщику.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказПоставщику.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаРасход,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Договор КАК Договор,
	|	ЗаказПоставщику.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПоставщику.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ЗаказПоставщику.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.ВидЦенКонтрагента = ЗНАЧЕНИЕ(Справочник.ВидыЦенКонтрагентов.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщику.Договор.ВидЦенКонтрагента
	|		ИНАЧЕ ЗаказПоставщику.ВидЦенКонтрагента
	|	КОНЕЦ КАК ВидЦенКонтрагента,
	|	Истина КАК РегистрироватьЦеныПоставщика,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПоставщику.Курс
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.ВалютаДокумента = НациональнаяВалюта.Значение
	|			ТОГДА ЗаказПоставщику.Кратность
	|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
	|		ПО ЗаказПоставщику.Договор.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта},
	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивЗаказов)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначенияПроверяемыхРеквизитов = Новый Структура("СостояниеЗаказа, Проведен", Выборка.СостояниеЗаказа, Выборка.ОснованиеПроведен);
		Документы.ЗаказПоставщику.ПроверитьВозможностьВводаНаОснованииЗаказаПоставщику(Выборка.ОснованиеСсылка, ЗначенияПроверяемыхРеквизитов);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если МассивЗаказов.Количество() = 1 Тогда
		ЭтотОбъект.ДокументОснование = МассивЗаказов[0];
	КонецЕсли;
	
	// Заполнение документа.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|		ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыОстатки.Характеристика КАК Характеристика,
	|		ЗаказыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				,
	|				ЗаказПоставщику В (&МассивЗаказов)
	|					И (Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|						ИЛИ Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))) КАК ЗаказыОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗаказыПоставщикам.ЗаказПоставщику,
	|		ДвиженияДокументаЗаказыПоставщикам.Номенклатура,
	|		ДвиженияДокументаЗаказыПоставщикам.Характеристика,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗаказыПоставщикам.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗаказыПоставщикам.Количество, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам КАК ДвиженияДокументаЗаказыПоставщикам
	|	ГДЕ
	|		ДвиженияДокументаЗаказыПоставщикам.Регистратор = &Ссылка) КАК ЗаказыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.ЗаказПоставщику,
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуЗапасы.Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказПоставщикуЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаРасход,
	|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуЗапасы.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	//+++ Дмгг
	//|	ЗаказПоставщикуЗапасы.Номенклатура.СчетУчетаЗатрат.ТипСчета КАК ТипСчета,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|			ТОГДА ЗаказПоставщикуЗапасы.Номенклатура.СчетУчетаЗатратРегл.ТипСчета
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчета,
	//--- Дмгг
	|	ЗаказПоставщикуЗапасы.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПоставщикуЗапасы.Количество КАК Количество,
	|	ЗаказПоставщикуЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПоставщикуЗапасы.Цена КАК Цена,
	|	ЗаказПоставщикуЗапасы.Сумма КАК Сумма,
	|	ЗаказПоставщикуЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПоставщикуЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПоставщикуЗапасы.Всего КАК Всего,
	|	ЗаказПоставщикуЗапасы.Содержание КАК Содержание,
	|	ЗаказПоставщикуЗапасы.Ссылка КАК ЗаказОснование,
	|	ЗаказПоставщикуЗапасы.ПроцентСкидкиНаценки,
	//++Lazare 28.12.2021
	|	ЗаказПоставщикуЗапасы.Проект
	//++Lazare 28.12.2021
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка В(&МассивЗаказов)
	|	И (ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИЛИ ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	ТаблицаОстатков.Индексы.Добавить("ЗаказПоставщику,Номенклатура,Характеристика");
	
	Запасы.Очистить();
	//Расходы.Очистить();
	//пСтавкаНДФЛ = Договор.ВидУдержанияНДФЛ.СтавкаНДФЛ;//Паганини
	Если ТаблицаОстатков.Количество() > 0 Тогда
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("ЗаказПоставщику", Выборка.ЗаказОснование);
			СтруктураДляПоиска.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураДляПоиска.Вставить("Характеристика", Выборка.Характеристика);
			
			МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрокОстатков.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			//Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			//	НоваяСтрока = Расходы.Добавить();
			//	НоваяСтрока.ЗаказПоставщику = Выборка.ЗаказОснование;
			//	НоваяСтрока.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиницаРасход;
			//	Если ЗначениеЗаполнено(Выборка.ЗаказПокупателя)
			//		И (Выборка.ТипСчета = Перечисления.ТипыСчетов.Расходы
			//		ИЛИ Выборка.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
			//		ИЛИ Выборка.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство) Тогда
			//		НоваяСтрока.Заказ = Выборка.ЗаказПокупателя;
			//	КонецЕсли;
			//	//Паганини_
			//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			//	НоваяСтрока.СуммаБезНалогов = ?(СуммаВключаетНДС, НоваяСтрока.Сумма - НоваяСтрока.СуммаНДС, НоваяСтрока.Сумма);
			//	Если Договор.УчитыватьНДФЛ Тогда
			//		Если СуммаВключаетНДС Тогда
			//			НоваяСтрока.СуммаНДФЛ	= Окр(НоваяСтрока.Сумма/(1-пСтавкаНДФЛ/100), 2)-НоваяСтрока.Сумма;
			//			НоваяСтрока.Всего		= НоваяСтрока.Сумма + НоваяСтрока.СуммаНДФЛ;
			//		Иначе
			//			НоваяСтрока.СуммаНДФЛ	= Окр((НоваяСтрока.Сумма+НоваяСтрока.СуммаНДС)*(пСтавкаНДФЛ/100)/(1-пСтавкаНДФЛ/100), 2);
			//			НоваяСтрока.Всего		= НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС + НоваяСтрока.СуммаНДФЛ;
			//		КонецЕсли;
			//		НоваяСтрока.ВидУдержанияНДФЛ			= Договор.ВидУдержанияНДФЛ;
			//	КонецЕсли;
			//	//_Паганини
			//Иначе
			//	НоваяСтрока = Запасы.Добавить();
			//	НоваяСтрока.Заказ = Выборка.ЗаказОснование;
			//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);//Паганини
			//КонецЕсли;
			////ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);//Паганини
			
			КоличествоКСписанию = Выборка.Количество * Выборка.Коэффициент;
			МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоКСписанию;
			//Если МассивСтрокОстатков[0].КоличествоОстаток < 0 Тогда
			//	
			//	КоличествоКСписанию = (КоличествоКСписанию + МассивСтрокОстатков[0].КоличествоОстаток) / Выборка.Коэффициент;
			//	
			//	СтруктураДанных = УправлениеНебольшойФирмойСервер.ПолучитьСуммуСтрокиТабличнойЧасти(
			//		Новый Структура("Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, СуммаВключаетНДС, Всего",
			//			КоличествоКСписанию, Выборка.Цена, 0, Выборка.СтавкаНДС, 0, СуммаВключаетНДС, 0));
			//	
			//	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
			//	
			//КонецЕсли;
			
			Если МассивСтрокОстатков[0].КоличествоОстаток <= 0 Тогда
				ТаблицаОстатков.Удалить(МассивСтрокОстатков[0]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщику()

Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если Не ДанныеЗаполнения.Свойство("МассивЗаказовПоставщикам") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения);
	
КонецПроцедуры
